DataProcessors/РассылкаКлиентамСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>РассылкаКлиентамСМС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстРассылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаОтправлять</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтосохранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодАвтосохранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФормам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеТипыДанных</Name>
					<Type>
						<v8:Type>v8:TypeDescription</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла XML, где хранятся запросы и параметры.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВРезультатахЗапросаЗначенияСсылок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧередованиеЦветовВРезультатеЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиРассылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запрос</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя запроса</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Comment>Текст запроса</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения в секундах</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСтрок</Name>
							<Comment>Количество возвращаемых строк в результате запроса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРезультата</Name>
							<Comment>Адрес временного хранилища, где хранится результат</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРезультатовЗапроса</Name>
							<Comment>Адрес массива результатов запроса во временном  хранилище</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Comment>Идентификатор</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗапроса</Name>
							<Comment>Идентификатор запроса</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>Тип</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПредметыПапкиВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ПредметыПапкиВзаимодействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПапкаЭлектронногоПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассмотретьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыВажностиВзаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВариантыВажностиВзаимодействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияДокументаСообщениеSMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СостоянияДокументаСообщениеSMS</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноДоставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДоставлено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСообщенияSMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СостоянияСообщенияSMS</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУдалосьПередатьПровайдеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправленоПровайдером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправляетсяПровайдером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоПровайдером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДоставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОпознаноПровайдером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПолученияСтатусаУПровайдера</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыВызовов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказЗвонка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаCallBack</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстнаяЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечнаяЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтернетРесурс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечнаяЗаявкаМОЛОДОСТРОЙ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтТинькофф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтДомофонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтНовостройМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтКвадрум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтЛидгенФейсбук</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КроссПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтИнстраграмм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентыВРаботеГПТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаИнстаграмСторис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтКанвас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтМирКвартир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтОдноклассники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаСВКонтакте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтCQ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтоваяЗаявкаОтCQ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаДомКлик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтГдеЭтотДом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусЗаявкиCallBack.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусЗаявкиCallBack</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БылиПопыткиДозвониться</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДозвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ГруппыРаспределенияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ГруппыРаспределенияЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГПТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консультанты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МенеджерыФилиалов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/РассылкаКлиентамСМС/Forms/ФормаОсновная/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьТекстРассылки(Мероприятие)
	
	Возврат Мероприятие.ТекстРассылки;
	
КонецФункции

&НаКлиенте
Процедура МаркетинговоеМероприятиеПриИзменении(Элемент)
	
	Объект.ТекстРассылки = ПолучитьТекстРассылки(Объект.МаркетинговоеМероприятие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязкаКЗапросуПриИзменении(Элемент)
	
	Элементы.Проект.Видимость = ПривязкаКЗапросу;
	Элементы.ПолучателиРассылкиЗапрос.Видимость = ПривязкаКЗапросу;
	
	Если Объект.ПолучателиРассылки.Количество() > 0 И ПривязкаКЗапросу Тогда
		ЗаполнитьДанныеЗапрос();			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеЗапрос()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		//|	ЗаявкаНаСделку.ДокументОснование КАК ДокументОснование
		//|ПОМЕСТИТЬ ВТ_Заявки
		//|ИЗ
		//|	Документ.ЗаявкаНаСделку.Дольщики КАК ЗаявкаНаСделкуДольщики
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаСделку КАК ЗаявкаНаСделку
		//|		ПО ЗаявкаНаСделкуДольщики.Ссылка = ЗаявкаНаСделку.Ссылка
		//|ГДЕ
		//|	ЗаявкаНаСделкуДольщики.Клиент В(&Клиент)
		//|	И ЗаявкаНаСделку.Проект = &Проект
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	Запрос.Дата КАК Дата,
		//|	ЗапросУчастники.Ссылка КАК Запрос,
		//|	ЗапросУчастники.Клиент КАК Клиент
		//|ИЗ
		//|	Документ.Запрос.Участники КАК ЗапросУчастники
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Запрос КАК Запрос
		//|		ПО ЗапросУчастники.Ссылка = Запрос.Ссылка
		//|ГДЕ
		//|	НЕ ЗапросУчастники.Ссылка В
		//|				(ВЫБРАТЬ
		//|					ВТ_Заявки.ДокументОснование КАК ДокументОснование
		//|				ИЗ
		//|					ВТ_Заявки КАК ВТ_Заявки)
		//|	И ЗапросУчастники.Клиент В(&Клиент)
		//|	И Запрос.Проект = &Проект
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Дата УБЫВ";
		"ВЫБРАТЬ
		|	Запрос.Дата КАК Дата,
		|	ЗапросУчастники.Ссылка КАК Запрос,
		|	ЗапросУчастники.Клиент КАК Клиент
		|ИЗ
		|	Документ.Запрос.Участники КАК ЗапросУчастники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Запрос КАК Запрос
		|		ПО ЗапросУчастники.Ссылка = Запрос.Ссылка
		|ГДЕ
		|	ЗапросУчастники.Клиент В(&Клиент)
		|	И Запрос.Проект = &Проект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Клиент", Объект.ПолучателиРассылки.Выгрузить(,"Клиент"));
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СписокСтрок = Объект.ПолучателиРассылки.НайтиСтроки(Новый Структура("Клиент", Выборка.Клиент));
			
			Если СписокСтрок.Количество() > 0 Тогда
				Для Каждого СтСписка Из СписокСтрок Цикл
					СтСписка.Запрос = Выборка.Запрос;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйЗапрос(Команда)
	
	ПараметрыФормы = Новый Структура("Объект", Объект);
	
	ОткрытьФорму("Обработка.РассылкаКлиентамСМС.Форма.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,, Новый ОписаниеОповещения("ОбработкаЗапроса", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗапроса(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат <> "" Тогда
		Объект.ПолучателиРассылки.Очистить();
		
		Для Каждого Ст Из Результат Цикл
			Если ЗначениеЗаполнено(Ст) Тогда
				НС = Объект.ПолучателиРассылки.Добавить();
				НС.Клиент = Ст;
			КонецЕсли;
		КонецЦикла;
		
		Если ПривязкаКЗапросу Тогда
			ЗаполнитьДанныеЗапрос();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Проект.Видимость = ПривязкаКЗапросу;
	Элементы.ПолучателиРассылкиЗапрос.Видимость = ПривязкаКЗапросу;
	Объект.КогдаОтправлять = ТекущаяДата();
	ДатаОкончания = КонецДня(ТекущаяДата()) - 2*60*60-59*60-59;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучателиРассылкиПриИзмененииНаСервере(Клиент, Проект)
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЗаявкаНаСделку.ДокументОснование КАК ДокументОснование
			|ПОМЕСТИТЬ ВТ_Заявки
			|ИЗ
			|	Документ.ЗаявкаНаСделку.Дольщики КАК ЗаявкаНаСделкуДольщики
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаСделку КАК ЗаявкаНаСделку
			|		ПО ЗаявкаНаСделкуДольщики.Ссылка = ЗаявкаНаСделку.Ссылка
			|ГДЕ
			|	ЗаявкаНаСделкуДольщики.Клиент = &Клиент
			|	И ЗаявкаНаСделку.Проект = &Проект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Запрос.Дата КАК Дата,
			|	ЗапросУчастники.Ссылка КАК Запрос
			|ИЗ
			|	Документ.Запрос.Участники КАК ЗапросУчастники
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Запрос КАК Запрос
			|		ПО ЗапросУчастники.Ссылка = Запрос.Ссылка
			|ГДЕ
			|	НЕ ЗапросУчастники.Ссылка В
			|				(ВЫБРАТЬ
			|					ВТ_Заявки.ДокументОснование КАК ДокументОснование
			|				ИЗ
			|					ВТ_Заявки КАК ВТ_Заявки)
			|	И ЗапросУчастники.Клиент = &Клиент
			|	И Запрос.Проект = &Проект
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.УстановитьПараметр("Проект", Проект);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Документы.Запрос.ПустаяСсылка();
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Возврат Выборка.Запрос;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПолучателиРассылкиПриИзменении(Элемент)
	
	Если ПривязкаКЗапросу Тогда
		ТекущиеДанные = Элементы.ПолучателиРассылки.ТекущиеДанные;
		ТекущиеДанные.Запрос = ПолучателиРассылкиПриИзмененииНаСервере(ТекущиеДанные.Клиент, Объект.Проект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВОбработкеНаСервере()
	
	//Для Каждого СтрокаКлиент Из Объект.ПолучателиРассылки Цикл
	//	СформироватьДокумент(ТекущаяДата, Объект.КогдаОтправлять, Объект.МаркетинговоеМероприятие, СтрокаКлиент.Клиент, СтрокаКлиент.Запрос, Объект.ТекстРассылки, ПривязкаКЗапросу);
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВОбработке(Команда)
	//ВыполнитьВОбработкеНаСервере();
	
	//Шаг = Цел(Объект.ПолучателиРассылки.Количество() / 20);
	Шаг = ОбъемСообщений;
	Индекс = 0;
	Порядок = 1;
	ДатаОтправки = Объект.КогдаОтправлять;
	КоличествоПолучателей = Объект.ПолучателиРассылки.Количество();
	
	МассивДанных = Новый Массив;
	
	ДатаОграничение = КонецДня(Объект.КогдаОтправлять) - 2*60*60-59*60-59;
	
	Для Каждого СтрокаТаблицы Из Объект.ПолучателиРассылки Цикл
		Сформировано = Ложь;
		
		Индекс = Индекс + 1;
		
		МассивДанных.Добавить(Новый Структура("Клиент, Запрос", СтрокаТаблицы.Клиент, СтрокаТаблицы.Запрос));
		Если Индекс >= Шаг Или Индекс >= КоличествоПолучателей Тогда
			ПараметрыЗадания = Новый Структура("Дата, Мероприятие, Клиенты, Текст, СЗапросом, ОднимДокументом", ДатаОтправки, Объект.МаркетинговоеМероприятие, МассивДанных, Объект.ТекстРассылки, ПривязкаКЗапросу, ОднимДокументом);
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(ПараметрыЗадания);
			
			СформироватьФоновоеЗадание(МассивПараметров, Порядок);
			
			МассивДанных.Очистить();
			ПараметрыЗадания.Очистить();
			
			Индекс = 0;
			Порядок = Порядок + 1;
			ДатаОтправки = ДатаОтправки + Периодичность * 60;
			
			Если ДатаОтправки >= ДатаОграничение Тогда
				ДатаОтправки = КонецДня(ДатаОграничение) + 1 + 9 * 60 * 60;
				ДатаОграничение = КонецДня(ДатаОтправки) - 2*60*60-59*60-59;
			КонецЕсли;
			Сформировано = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДанных.Количество() > 0 И Не Сформировано Тогда
		ПараметрыЗадания = Новый Структура("Дата, Мероприятие, Клиенты, Текст, СЗапросом, ОднимДокументом", ДатаОтправки, Объект.МаркетинговоеМероприятие, МассивДанных, Объект.ТекстРассылки, ПривязкаКЗапросу, ОднимДокументом);
			
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ПараметрыЗадания);
		
		СформироватьФоновоеЗадание(МассивПараметров, Порядок);
	КонецЕсли;
	
	Сообщить("Формирование СМС запущено в фоновом задании.");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьФоновоеЗадание(ПараметрыЗадания, Порядок)

	ВидСообщения = НСтр("ru = 'Формирование фоновых заданий для создания документов СМС по рассылке.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
	ФоновыеЗадания.Выполнить("CRMРегаментныеЗадания.СформироватьДокументыСМСВФоне", ПараметрыЗадания, "ФормированиеСМС_" + Строка(Порядок), "Формирование СМС " + Строка(Порядок));
	
	ЗаписьЖурналаРегистрации(ВидСообщения, УровеньЖурналаРегистрации.Информация,,, "Сформировано фоновае задание: ФормированиеСМС_" + Строка(Порядок));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьДокумент(ТекущаяДата, КогдаОтправлять, МаркетинговоеМероприятие, Клиент, Запрос, ТекстСообщения, ПривязкаКЗапросу)
	
	НовыйДокумент = Документы.СообщениеSMS.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата;
	НовыйДокумент.Автор = Пользователи.ТекущийПользователь();
	НовыйДокумент.Важность = Перечисления.ВариантыВажностиВзаимодействия.Обычная;
	//НовыйДокумент.ДатаАктуальностиОтправки = НовыйДокумент.Дата;
	НовыйДокумент.ДатаКогдаОтправить = КогдаОтправлять;
	НовыйДокумент.Комментарий = "Сформирвано автоматически";
	НовыйДокумент.МаркетинговоеМероприятие = МаркетинговоеМероприятие;
	
	НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДокумент.Отменено = Ложь;
	НовыйДокумент.ОтправлятьВТранслите = Ложь;
	НовыйДокумент.Состояние = Перечисления.СостоянияДокументаСообщениеSMS.Исходящее;
	НовыйДокумент.СписокУчастников = Строка(Клиент);
	НовыйДокумент.ТекстСообщения = ТекстСообщения;
	НовыйДокумент.Тема = "Рассылка по маркетинговому мероприятию """ + МаркетинговоеМероприятие + """ от " + Строка(НовыйДокумент.Дата);
	
	НоваяСтрока = НовыйДокумент.Адресаты.Добавить();
	НоваяСтрока.КакСвязаться = СокрЛП(Клиент.ОсновнойТелефон);
	НоваяСтрока.Контакт = Клиент;
	НоваяСтрока.НомерДляОтправки = НоваяСтрока.КакСвязаться;
	НоваяСтрока.ПредставлениеКонтакта = Строка(Клиент);
	НоваяСтрока.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.Исходящее;
	
	//НоваяСтрока = НовыйДокумент.НаборыЗначенийДоступа.Добавить();
	//НоваяСтрока.ЗначениеДоступа
	
	Попытка
		НовыйДокумент.Записать();
	Исключение
		Сообщить("Не удалось сформировать документ по клиенту " + Клиент + " - " + ОписаниеОшибки());
	КонецПопытки;
	
	Если ПривязкаКЗапросу Тогда
		Если ЗначениеЗаполнено(Запрос) Тогда
		
			НС = РегистрыСведений.ПредметыПапкиВзаимодействий.СоздатьНаборЗаписей();
			НС.Отбор.Взаимодействие.Установить(НовыйДокумент.Ссылка);
			
			Запись = НС.Добавить();
			Запись.Взаимодействие = НовыйДокумент.Ссылка;
			Запись.Предмет = Запрос;
			
			Попытка
				НС.Записать();
			Исключение
				Сообщить("Не удалось записать предмет к документу " + Строка(НовыйДокумент));
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ЗаполнитьДанныеЗапрос();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗвонкиНаСервере()
	
	ТекущаяДата = ТекущаяДата();
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	Для Каждого СтрКлиент Из Объект.ПолучателиРассылки Цикл
		
		НовыйДокумент = Документы.ЗаявкаНаЗвонок.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДата;
		НовыйДокумент.Контакт = СтрКлиент.Клиент;
		НовыйДокумент.Проект = Объект.Проект;
		НовыйДокумент.МаркетинговоеМероприятие = Объект.МаркетинговоеМероприятие;
		НовыйДокумент.Автор = Пользователи.ТекущийПользователь();
		//НовыйДокумент.Ответственный = ТекПользователь;
		НовыйДокумент.ДатаРаспределения = Объект.КогдаОтправлять;
		
		НовыйДокумент.ТипВызова = Перечисления.ТипыВызовов.УстнаяЗаявка;
		НовыйДокумент.Статус = Перечисления.СтатусЗаявкиCallBack.НеОбработано;
		НовыйДокумент.ГруппаРаспределения = Перечисления.ГруппыРаспределенияЗаявок.ГПТ;
		НовыйДокумент.ЭтапРаботы = Перечисления.ЭтапыРаботыЗавок.Начальный;
		НовыйДокумент.Приоритет = Перечисления.ПриоритетыЗаявокНаЗвонок.Приоритет4;
		
		Если ПривязкаКЗапросу Тогда
			Если ЗначениеЗаполнено(СтрКлиент.Запрос) Тогда
				НовыйДокумент.ПредметВзаимодействия = СтрКлиент.Запрос;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			НовыйДокумент.Записать();
		Исключение
			Сообщить("Не удалось сформировать документ по клиенту " + СтрКлиент.Клиент + " - " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗвонки(Команда)
	//СформироватьЗвонкиНаСервере();
	
	ТекПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Шаг = Цел(Объект.ПолучателиРассылки.Количество() / 20);
	Индекс = 0;
	Порядок = 1;
	
	МассивДанных = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Объект.ПолучателиРассылки Цикл
		
		Индекс = Индекс + 1;
		
		МассивДанных.Добавить(Новый Структура("Клиент, Запрос", СтрокаТаблицы.Клиент, СтрокаТаблицы.Запрос));
		Если Индекс >= Шаг Тогда
			ПараметрыЗадания = Новый Структура("Дата, Мероприятие, Клиенты, Текст, СЗапросом, Пользователь, Проект", Объект.КогдаОтправлять, Объект.МаркетинговоеМероприятие, МассивДанных, Объект.ТекстРассылки, ПривязкаКЗапросу, ТекПользователь, Объект.Проект);
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(ПараметрыЗадания);
			
			СформироватьФоновоеЗаданиеНаЗвонок(МассивПараметров, Порядок);
			
			МассивДанных.Очистить();
			ПараметрыЗадания.Очистить();
			
			Индекс = 0;
			Порядок = Порядок + 1;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Формирование документов ""Заявка на звонок"" запущено в фоновых заданиях.");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьФоновоеЗаданиеНаЗвонок(ПараметрыЗадания, Порядок)

	ФоновыеЗадания.Выполнить("CRMРегаментныеЗадания.СформироватьДокументыЗаявкаНаЗвонокВФоне", ПараметрыЗадания, "ФормированиеЗаявкаНаЗвонок_" + Строка(Порядок), "Формирование ЗаявкаНаЗвонок " + Строка(Порядок));
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДублиКлиентов(Команда)
	
	СписокКлиентов = Объект.ПолучателиРассылки.Выгрузить();
	Если ПривязкаКЗапросу Тогда
		СписокКлиентов.Свернуть("Клиент, Запрос");
	Иначе
		СписокКлиентов.Свернуть("Клиент");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Дата1 = ?(ДатаОкончания > КонецДня(ДатаОкончания) - 2*60*60-59*60-59, КонецДня(ДатаОкончания) - 2*60*60-59*60-59, ДатаОкончания);
		Дата2 = ?(Объект.КогдаОтправлять < НачалоДня(Объект.КогдаОтправлять) + 9*60*60, НачалоДня(Объект.КогдаОтправлять) + 9*60*60, Объект.КогдаОтправлять);
		
		РазностьДат = РазностьДат(Дата1, Дата2);
		
		ОбъемСообщений = Окр(Объект.ПолучателиРассылки.Количество() * ?(РазностьДат = 0, 1, Периодичность / РазностьДат), 0);
		Объект.КогдаОтправлять = Дата2;
		ДатаОкончания = Дата1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Дата1 = ?(ДатаОкончания > КонецДня(ДатаОкончания) - 2*60*60-59*60-59, КонецДня(ДатаОкончания) - 2*60*60-59*60-59, ДатаОкончания);
		Дата2 = ?(Объект.КогдаОтправлять < НачалоДня(Объект.КогдаОтправлять) + 9*60*60, НачалоДня(Объект.КогдаОтправлять) + 9*60*60, Объект.КогдаОтправлять);
		
		РазностьДат = РазностьДат(Дата1, Дата2);
		
		ОбъемСообщений = Окр(Объект.ПолучателиРассылки.Количество() * ?(РазностьДат = 0, 1, Периодичность / РазностьДат), 0);
		Объект.КогдаОтправлять = Дата2;
		ДатаОкончания = Дата1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъемСообщенийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Периодичность) Тогда
		
		ДатаОкончания = Дата(1,1,1);
		
		//ОбъемСообщений = Объект.ПолучателиРассылки.Количество() * Периодичность / РазностьДат(ДатаОкончания, Объект.КогдаОтправлять);
		//Периодичность = Окр(ОбъемСообщений * РазностьДат(ДатаОкончания, Объект.КогдаОтправлять) / Объект.ПолучателиРассылки.Количество(), 0);
		
		ДатаОграничения = КонецДня(Объект.КогдаОтправлять) - 2*60*60-59*60-59; //21:00:00 
		
		МинутНаДоставку = Периодичность * Объект.ПолучателиРассылки.Количество() / ОбъемСообщений;
		Счетчик = 0;
		КогдаОтправлять = Объект.КогдаОтправлять;
		
		Пока Счетчик <= МинутНаДоставку Цикл
			ДатаОкончания = КогдаОтправлять + Счетчик * 60;
			Если ДатаОкончания >= ДатаОграничения Тогда
				КогдаОтправлять = КонецДня(ДатаОграничения) + 1 + 9 * 60 * 60; //09:00:00 следующего дня
				ДатаОграничения = КонецДня(КогдаОтправлять) - 2*60*60-59*60-59;
				
				МинутНаДоставку = МинутНаДоставку - Счетчик;
				Счетчик = Периодичность;
			Иначе
				Счетчик = Счетчик + Периодичность;
			КонецЕсли;
		КонецЦикла;
		
		//ДатаОкончания = Объект.КогдаОтправлять + хххх
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазностьДат(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(&Дата1, &Дата2, МИНУТА) КАК Разность";
	
	Запрос.УстановитьПараметр("Дата1", ДатаОкончания);
	Запрос.УстановитьПараметр("Дата2", ДатаНачала);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Разность;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КогдаОтправлятьПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Дата1 = ?(ДатаОкончания > КонецДня(ДатаОкончания) - 2*60*60-59*60-59, КонецДня(ДатаОкончания) - 2*60*60-59*60-59, ДатаОкончания);
		Дата2 = ?(Объект.КогдаОтправлять < НачалоДня(Объект.КогдаОтправлять) + 9*60*60, НачалоДня(Объект.КогдаОтправлять) + 9*60*60, Объект.КогдаОтправлять);
		
		ОбъемСообщений = Окр(Объект.ПолучателиРассылки.Количество() * Периодичность / РазностьДат(Дата1, Дата2), 0);
	КонецЕсли;
	
КонецПроцедуры
